КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/КонтурЛогистика_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Сотрудники</name>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>(Для кладовщика) если кладовщик указывается, то обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>ИНН физического лица, Обязателен при отсутствии &lt;НомВУ> и &lt;СерВУ> и &lt;ДатаВыдВУ></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеСведения</name>
    <comment>(Для кладовщика) Иные сведения, идентифицирующие физическое лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочий</name>
    <comment>(Для кладовщика) Основание полномочий ТЕКСТ (доверия) на осуществление действий по погрузке груза в транспортное средство: по умолч: &quot;должностные обязанности&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочийДоговор</name>
    <comment>(Для кладовщика)  Основание полномочий ДОГОВОР (доверия) на осуществление действий по погрузке груза в транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВодитель</name>
    <comment>Признак, что Может выступать в качестве водителя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКладовщик</name>
    <comment>Признак, что Может выступать в качестве кладовщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМедик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМеханик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗапасной</name>
    <comment>необязателен</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <comment>обязателен, в любом формате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительства</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительстваСтрана</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗарегестрированВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеКонтактныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенияРаботыСДокументами</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПодписывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПередаватьНаПодпись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		
		Наименование = СокрЛП(Фамилия);
		
		Если ЗначениеЗаполнено(Имя) Тогда 
			Наименование = Наименование + " " + Лев(СокрЛП(Имя), 1) + ".";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отчество) Тогда 
			Наименование = Наименование + " " + Лев(СокрЛП(Отчество), 1) + ".";
		КонецЕсли;
		
		Если РольВодитель И
			(ЗначениеЗаполнено(ВУСерия) Или ЗначениеЗаполнено(ВУНомер)) Тогда
			
			Наименование = Наименование + " ("
				+ ?(ЗначениеЗаполнено(ВУСерия), ВУСерия + " ", "") + ВУНомер + ")";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВФорматеСНИЛС(СНИЛС) Тогда
		СНИЛС = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПривестиЗначениеКФорматуСНИЛС(СНИЛС);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_Сотрудники_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	КонецЕсли;
	
	// Заполним разрешения
	ЗаполнитьРазрешенияРаботыСДокументами();
	
КонецПроцедуры

Процедура ЗаполнитьРазрешенияРаботыСДокументами() Экспорт
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	Для Каждого ТекущаяОрганизация Из НашиОрганизации Цикл
		НоваяСтрока = РазрешенияРаботыСДокументами.Добавить();
		НоваяСтрока.Организация = ТекущаяОрганизация;
		НоваяСтрока.МожетПодписывать = Истина;
		НоваяСтрока.МожетПередаватьНаПодпись = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
